Core/src/Documents/ТаможенноеОформление/ТаможенноеОформление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможенноеОформление</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СебестоимостьЗакупки</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИмпорта</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходовНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitNetWeight</name>
      <comment>Unit net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitGrossWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountNet</name>
      <comment>Amount net</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountGross</name>
      <comment>Amount gross</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostOfTheProductOur</name>
      <comment>Cost of The Product Our</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostOfTheProductRSge</name>
      <comment>Cost of The Product RS.ge</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CalculatedByProgram</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CalculatedByCustoms</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ТаможенноеОформление/Forms/ФормаПодбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыВХранилище = Параметры.АдресТаблицыВХранилище;
	а=1;
	Организация = Параметры.Отборы.Организация;
	ДатаИмпорта = Параметры.Отборы.Дата;
										 //ДокументыПоступления.Отбор.ДоступныеПоляОтбора.Элементы[17].Элементы[8]
	ГруппаОтбора = ДокументыПоступления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//Отбираем только те у которых есть хоть одна запись в Запасах
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проведен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	//Организация         ДокументыПоступления.Отбор.Элементы.Добавить(
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Организация;
	
	//Дата          ДокументыПоступления.Отбор.Элементы.Добавить(
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ДатаИмпорта;
	
	//ВидОперации
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
	
	//Отбираем только те у которых есть хоть одна запись в Запасах
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Запасы.НомерСтроки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = 1;
	
	// Только документы с пометкой Импорт
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Импорт");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	УстановаитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановаитьВидимость()

	Элементы.ЗапазыДокументаХарактеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.ЗапазыДокументаХарактеристика.Доступность = ИспользоватьХарактеристики;
	
	Элементы.РезультатВыбора1Характеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.РезультатВыбора1Характеристика.Доступность = ИспользоватьХарактеристики;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	а=1;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияПриАктивизацииСтроки(Элемент)
	а=1;
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	
	ЗапасыДокумента.Отбор.Элементы.Очистить();
	
	ГруппаОтбора = ЗапасыДокумента.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//Отбираем номенклавтуру по выбранному документу
	Если ТекСтрокаДокумент <> Неопределено Тогда 
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ТекСтрокаДокумент.Ссылка;
		
	Иначе
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Документ.ПриходнаяНакладная.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТаблицаВХранилище = РезультатВыбора.Выгрузить();
	ТаблицаВХранилище.Колонки.Найти("Документ").Имя = "ДокументПоступления";
	ПоместитьВоВременноеХранилище(ТаблицаВХранилище, АдресТаблицыВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Отказ = Ложь;
	
	//ПроверитьЗаполнениеРеквизитовФормы(Отказ);
	
	Если НЕ Отказ Тогда
		ЗаписатьПодборВХранилище();
		Закрыть(КодВозвратаДиалога.OK);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	ДокументыПоступленияВыборНаСервере(ТекСтрокаДокумент.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПоступленияВыборНаСервере(ДокумментСсылка)
	      
	тчЗапасы = ДокумментСсылка.Запасы;
	тзЗагрузки = тчЗапасы.Выгрузить();
	
	Для Каждого Строк Из тзЗагрузки Цикл 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Документ", ДокумментСсылка);
		СтруктураПоиска.Вставить("Номенклатура", Строк.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", Строк.Характеристика);
		СтруктураПоиска.Вставить("Количество", Строк.Количество);
		СтруктураПоиска.Вставить("Цена", Строк.Цена);
		СтруктураПоиска.Вставить("Сумма", Строк.Сумма);
		//СтруктураПоиска.Вставить("СтавкаНДС", Строк.СтавкаНДС);
		
		ПоискСтроки = РезультатВыбора.НайтиСтроки(СтруктураПоиска);
		Если ПоискСтроки.Количество() = 0 Тогда 
			НовСтрок = РезультатВыбора.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрок, Строк);
			НовСтрок.Документ = ДокумментСсылка;
			НовСтрок.СтавкаНДС = НовСтрок.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапазыДокументаВыборНаСервере(СтруктураСтроки)
	
	тзРезультатВыбора = РезультатВыбора.Выгрузить();
	ПоискСтроки = тзРезультатВыбора.НайтиСтроки(СтруктураСтроки);
	Если ПоискСтроки.Количество() = 0 Тогда 
		НовСтрок = РезультатВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрок, СтруктураСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапазыДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрокаДокумент = Элементы.ЗапасыДокумента.ТекущиеДанные;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Документ", ТекСтрокаДокумент.Ссылка);
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ТекСтрокаДокумент.ЕдиницаИзмерения);
	СтруктураСтроки.Вставить("Номенклатура", ТекСтрокаДокумент.Номенклатура);
	Если ИспользоватьХарактеристики Тогда //ИспользоватьХарактеристики
		СтруктураСтроки.Вставить("Характеристика", ТекСтрокаДокумент.Характеристика);
	КонецЕсли;
	СтруктураСтроки.Вставить("Количество", ТекСтрокаДокумент.Количество);
	СтруктураСтроки.Вставить("Цена", ТекСтрокаДокумент.Цена);
	СтруктураСтроки.Вставить("Сумма", ТекСтрокаДокумент.Сумма);
	СтруктураСтроки.Вставить("СтавкаНДС", ТекСтрокаДокумент.СтавкаНДС);
	
	ЗапазыДокументаВыборНаСервере(СтруктураСтроки);
	
КонецПроцедуры

&НаСервере
Процедура РезультатВыбора1НоменклатураПриИзмененииНаСервере(УИД)
	
	ТекСтрок = РезультатВыбора.НайтиПоИдентификатору(УИД);
	Если НЕ ЗначениеЗаполнено(ТекСтрок.Документ) Тогда 
		Сообщить(НСтр("ka='Укажите документ!';ru='Укажите документ!';en='Specify the document!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		ТекСтрок.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		ТекСтрок.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ТекСтрок.Количество = 0;
		ТекСтрок.Цена = 0;
		ТекСтрок.Сумма = 0;
		ТекСтрок.СтавкаНДС = 0;
		Возврат;
	КонецЕсли;
	
	тчЗапасыДокумента = ТекСтрок.Документ.Запасы;
	
	//МассивСтрокЗапасов = тчЗапасыДокумента.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения", ТекСтрок.Номенклатура, ТекСтрок.Характеристика, ТекСтрок.ЕдиницаИзмерения));
	МассивСтрокЗапасов = тчЗапасыДокумента.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрок.Номенклатура));
	
	Если МассивСтрокЗапасов.Количество() = 0 Тогда 
		Сообщить(НСтр("ka='В документе нет указанной номенклатуры!';ru='В документе нет указанной номенклатуры!';en='The document is not specified range!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбора1НоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ТекСтрокаДокумент = Элементы.РезультатВыбора1.ТекущиеДанные;
	УИД = ТекСтрокаДокумент.ПолучитьИдентификатор();
	РезультатВыбора1НоменклатураПриИзмененииНаСервере(УИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзДокумента(Команда)
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	ДокументыПоступленияВыборНаСервере(ТекСтрокаДокумент.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыПоступленияОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекСтрокаДокумент = Элементы.ДокументыПоступления.ТекущиеДанные;
	ДокументыПоступленияВыборНаСервере(ТекСтрокаДокумент.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыДокументаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекСтрокаДокумент = Элементы.ЗапасыДокумента.ТекущиеДанные;
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Документ", ТекСтрокаДокумент.Ссылка);
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", ТекСтрокаДокумент.ЕдиницаИзмерения);
	СтруктураСтроки.Вставить("Номенклатура", ТекСтрокаДокумент.Номенклатура);
	СтруктураСтроки.Вставить("Характеристика", ТекСтрокаДокумент.Характеристика);
	СтруктураСтроки.Вставить("Количество", ТекСтрокаДокумент.Количество);
	СтруктураСтроки.Вставить("Цена", ТекСтрокаДокумент.Цена);
	СтруктураСтроки.Вставить("Сумма", ТекСтрокаДокумент.Сумма);
	СтруктураСтроки.Вставить("СтавкаНДС", ТекСтрокаДокумент.СтавкаНДС);
	
	ЗапазыДокументаВыборНаСервере(СтруктураСтроки);
	
КонецПроцедуры
